---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipeLossMethodType
source: html/d6f70bd4-d74c-23b8-002b-0caf388731fd.htm
---
# Autodesk.Revit.DB.Plumbing.PipeLossMethodType

An enumerated type listing all pipe loss method types for a connector

## Syntax (C#)
```csharp
public enum PipeLossMethodType
```